#saxeli = "saba"
#print(saxeli)
#არ გამოაქვს მნიშვნელობა რადგან ცვლადი დაკომენტარებული

#case-sensitive-ის მაგალითი: 
#Print("goa") მოგვცემს: error-ს
#ხოლო print("goa") ჩვეულებრივ იმუშავებს


credit = 2
Credit = 1
CREDIT = 5

print(CREDIT)
print(Credit)
print(credit)

#ეს ცვლადები არის სხვადასხვა მნიშვნელობის რადგან case sensitive არის 

num = 5
num = 7

print(num)

#პირველი მნიშვნელობა დაპრინტა მეორეს მაგივრად რადგან კომპიუტერი კოდს კითხულობს ზევიდან ქვევით
#და ცვლადში ბოლო ცვლილება დააფიქსირა შედეგად დაპრინტა 7 და არა 5