'''1) გააკეთეთ 3 ცალი სწორი კოდი და 3 ცალი არასწორი კოდი და უნდა ახსნათ რატომ არის ეს კოდი სწორი და
 რატომ არის ეს კოდი არასწორი

2) ახსენით debugger-ი რაარის კომენტარებით და გააკეთეთ ასევე მაგალითებიც

3) შექმენით ცვლადი რომელიც იქნება name და მინიჭებული იქნება თქვენი სახელი და უნდა დაპრინტოთ
 ეს ცვლადი სწორი გზით და არასწორი გზით
 და უნდა ახსნათ კომენტარებით რატომ არის ეს გზა სწორი და რატომ არ არის ეს გზა სწორი

4) დაპრინტეთ GOA is the best academy in georgia სწორი გზით და არასწორი გზით და ახსენით კომენტარებით 
რატომ არის ეკ გზა სწორი და რატომ არ არის მეორე გზა სწორი

5) უყურეთ დღევანდელ ჩანაწერს'''

#1)

#country = america
#ეს შეცდომა იმიტომ არის რადგანაც ბრჭყალებში აკლია
country = "america"

#print"saba"
#ეს შეცდომა იმიტომ არის რადგანაც ფრჩხილები აკლია
print("saba")

#print("10" + 10)
#ეს შეცდომა იმიტომ არის რადგანაც ყველაფერი ბრჭყალებში არის სტრინგი და სტრინგს ვერ მივუმატებდ ინტეჯერს
print(10 + 10)


#2)

name = "saba"

print("name")
#ეს კოდი მიმიტომ არის არასწორი რადგანაც ბრჭყალები აქვს და კომპიუტერი სტრინგად აღიქვამს
print(name)

#3)



print("GOA is the best academy in georgia")
#print(GOA is the best academy in georgia)
#ეს პრინტი არის არასწორი რადგანაც ბრჭყალები აკლია